#+TITLE: MVE Lisp Unit Testing
#+DATE: <2015-12-11 Fri>
#+AUTHOR: Brian Beckman
#+EMAIL: bbeckman@amazon.com
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.3.1 (Org mode 8.0.7)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+LaTeX_CLASS_OPTIONS: [10pt,oneside,x11names]
#+LaTeX_HEADER: \usepackage{geometry}
#+LaTeX_HEADER: \usepackage{palatino}
#+LaTeX_HEADER: \usepackage{siunitx}
#+LaTeX_HEADER: \usepackage{braket}
#+LaTeX_HEADER: \usepackage[euler-digits,euler-hat-accent]{eulervm}
#+OPTIONS: toc:2

* Preliminaries

#+BEGIN_SRC emacs-lisp :results output :exports results :tangle no
  (princ (concat (format "Emacs version: %s\n" (emacs-version))
                 (format "org version: %s\n" (org-version))))
  (setq org-confirm-babel-evaluate nil)
  (org-babel-map-src-blocks nil (org-babel-remove-result))
#+END_SRC

#+RESULTS:
: Emacs version: GNU Emacs 24.5.1 (x86_64-apple-darwin13.4.0, NS apple-appkit-1265.21)
:  of 2015-04-10 on builder10-9.porkrind.org
: org version: 8.3.1

  This is version 0.0.1 of my unit-testing MVE (Minimal Viable Example) in
  Common Lisp.

* Running Tests

  The easiest way to run the code in this file is interactively, directly in the
  org-mode buffer. The easiest way to do that is to

  1. Extract the code in this file /via/ =org-babel-tangle=
  2. Run the following block; just put the cursor inside the block and type
     =Ctrl-C Ctrl-C=

  If, after tangling, you want to run the code from the command line, outside of
  this buffer, just load =really-run-tests.lisp=.

  I think it's possible to run the entire thing interactively without tangling
  first, but it's not easy.

  When we want the condition-catching extensions, we must load =lisp-unit= /via/
  =quickload=. See https://github.com/OdonataResearchLLC/lisp-unit/wiki and
  https://www.quicklisp.org/.

#+BEGIN_SRC lisp :results output :exports both :tangle really-run-tests.lisp
  (load "~/quicklisp/setup.lisp")
  (ql:quickload :lisp-unit)
  (setf *print-failures* t)
  (load "unit-testing.lisp")
#+END_SRC

#+RESULTS:
#+begin_example
To load "lisp-unit":
  Load 1 ASDF system:
    lisp-unit
; Loading "lisp-unit"

Unit Test Summary
 | 17 assertions total
 | 17 passed
 | 0 failed
 | 3 execution errors
 | 0 missing tests

#+end_example

